{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": null,
  "userDefinedMetadata": {
    "name": "sugarcane_leaf_classifier",
    "version": "1.0.0",
    "description": "Binary classifier for sugarcane leaf detection",
    "input_shape": [224, 224, 3],
    "classes": ["not_sugarcane_leaf", "sugarcane_leaf"]
  },
  "modelInitializer": {},
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sugarcane_leaf_classifier",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Lambda",
          "config": {
            "name": "normalization",
            "trainable": true,
            "function": ["4", "return tf.div(tf.sub(x, 127.5), 127.5);"]
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "block1_conv1",
            "trainable": true,
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [2, 2],
            "padding": "same",
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "block1_bn",
            "trainable": true,
            "axis": 3
          }
        },
        {
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "block2_depthwise",
            "trainable": true,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "depth_multiplier": 1,
            "activation": "relu",
            "use_bias": false
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "block2_bn",
            "trainable": true,
            "axis": 3
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "block2_pointwise",
            "trainable": true,
            "filters": 64,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "same",
            "activation": "relu",
            "use_bias": false
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "block2_pointwise_bn",
            "trainable": true,
            "axis": 3
          }
        },
        {
          "class_name": "DepthwiseConv2D",
          "config": {
            "name": "block3_depthwise",
            "trainable": true,
            "kernel_size": [3, 3],
            "strides": [2, 2],
            "padding": "same",
            "depth_multiplier": 1,
            "activation": "relu",
            "use_bias": false
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "block3_bn",
            "trainable": true,
            "axis": 3
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "block3_pointwise",
            "trainable": true,
            "filters": 128,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "same",
            "activation": "relu",
            "use_bias": false
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "block3_pointwise_bn",
            "trainable": true,
            "axis": 3
          }
        },
        {
          "class_name": "GlobalAveragePooling2D",
          "config": {
            "name": "global_average_pooling",
            "trainable": true,
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "rate": 0.2
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "predictions",
            "trainable": true,
            "units": 2,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["model_weights.bin"],
      "weights": [
        {
          "name": "block1_conv1/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block1_bn/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block1_bn/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block1_bn/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block1_bn/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block2_depthwise/depthwise_kernel",
          "shape": [3, 3, 32, 1],
          "dtype": "float32"
        },
        {
          "name": "block2_bn/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block2_bn/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block2_bn/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block2_bn/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "block2_pointwise/kernel",
          "shape": [1, 1, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "block2_pointwise_bn/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block2_pointwise_bn/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block2_pointwise_bn/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block2_pointwise_bn/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block3_depthwise/depthwise_kernel",
          "shape": [3, 3, 64, 1],
          "dtype": "float32"
        },
        {
          "name": "block3_bn/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block3_bn/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block3_bn/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block3_bn/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "block3_pointwise/kernel",
          "shape": [1, 1, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "block3_pointwise_bn/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "block3_pointwise_bn/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "block3_pointwise_bn/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "block3_pointwise_bn/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "predictions/kernel",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "predictions/bias",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ]
}
